In [97]:
import pandas as pd
import numpy as np

In [98]:
tit=pd.read_csv('D:\\ml\exl\\titanic.csv')
tit.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [99]:
data= tit.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns')

In [101]:
from sklearn.preprocessing import LabelEncoder
gender=LabelEncoder()

In [102]:
data['gen']=gender.fit_transform(data['Sex'])

In [128]:
titanic=data.drop(['Sex','Survived'],axis='columns')

In [129]:
titanic.Age=titanic.Age.fillna(titanic.Age.mean())

In [105]:
titanic.Age[:100]

0     22.000000
1     38.000000
2     26.000000
3     35.000000
4     35.000000
        ...
95    29.699118
96    71.000000
97    23.000000
98    34.000000
99    34.000000
Name: Age, Length: 100, dtype: float64

In [143]:
titanic

     Pclass        Age     Fare  gen
0         3  22.000000   7.2500    1
1         1  38.000000  71.2833    0
2         3  26.000000   7.9250    0
3         1  35.000000  53.1000    0
4         3  35.000000   8.0500    1
..      ...        ...      ...  ...
886       2  27.000000  13.0000    1
887       1  19.000000  30.0000    0
888       3  29.699118  23.4500    0
889       1  26.000000  30.0000    1
890       3  32.000000   7.7500    1

[891 rows x 4 columns]

In [131]:
y=data.Survived

In [132]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [135]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test =train_test_split(titanic,y,test_size=0.4)

In [136]:
len(X_test)

357

In [117]:
len(X_train)

534

In [118]:
from sklearn import tree
model=tree.DecisionTreeClassifier()

In [119]:
y_train

268    1
352    0
437    1
417    1
54     0
      ..
863    0
321    0
113    0
131    0
824    0
Name: Survived, Length: 534, dtype: int64

In [138]:
model.fit(X_train, y_train)

DecisionTreeClassifier()

In [139]:
X_train[:100]

     Pclass        Age      Fare  gen
534       3  30.000000    8.6625    0
565       3  24.000000   24.1500    1
582       2  54.000000   26.0000    1
8         3  27.000000   11.1333    0
735       3  28.500000   16.1000    1
..      ...        ...       ...  ...
118       1  24.000000  247.5208    1
199       2  24.000000   13.0000    0
451       3  29.699118   19.9667    1
671       1  31.000000   52.0000    1
564       3  29.699118    8.0500    0

[100 rows x 4 columns]

In [140]:
model.score(X_test,y_test)

0.7927170868347339

In [145]:
model.predict([[3,30.000000,8.6625,0]])

array([0], dtype=int64)

In [151]:
model.predict(X_test)

array([0, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0, 0, 0, 0,
       0, 0, 0, 1, 0, 0, 1, 0, 0, 1, 0, 0, 1, 1, 1, 1, 0, 0, 1, 0, 0, 0,
       0, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 1, 1,
       0, 0, 0, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0,
       1, 0, 0, 1, 0, 1, 0, 1, 1, 1, 1, 1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1,
       0, 0, 1, 1, 0, 1, 1, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 0, 0, 0,
       0, 1, 0, 0, 1, 0, 1, 0, 0, 1, 0, 0, 0, 0, 0, 1, 0, 0, 1, 0, 0, 1,
       0, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 1, 0, 0, 1, 0, 0, 1, 0, 0,
       1, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1,
       0, 1, 0, 0, 1, 1, 1, 0, 0, 0, 0, 1, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1,
       1, 1, 0, 1, 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 1, 0, 1, 1, 1, 0, 1,
       1, 1, 0, 1, 1, 1, 1, 0, 0, 1, 0, 1, 0, 0, 0, 1, 1, 0, 1, 1, 1, 0,
       0, 0, 1, 0, 0, 0, 1, 1, 0, 0, 0, 1, 1, 1, 1, 1, 0, 1, 0, 1, 1, 0,
       0, 0, 0, 1, 0, 0, 0, 0, 1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 0, 1, 0, 0,
       0, 1, 0, 1, 0, 0, 0, 1, 0, 1, 0, 1, 0, 0, 1, 0, 1, 0, 0, 0, 0, 0,
       1, 0, 0, 1, 0, 1, 1, 1, 0, 1, 1, 0, 0, 0, 1, 1, 0, 0, 1, 0, 0, 0,
       1, 1, 0, 0, 0], dtype=int64)